clc,clear;
n=39;

%铁路的最短路径及最少运费
a1=zeros(n);
a1(1,14)=20;a1(1,15)=202;
a1(2,15)=1200;
a1(3,16)=690;
a1(4,19)=690;
a1(5,18)=462;
a1(6,23)=70;
a1(7,24)=30;
a1(8,10)=450;
a1(9,10)=80;
a1(10,12)=1150;
a1(11,13)=306;
a1(12,15)=1100;
a1(13,14)=195;
a1(15,16)=720;
a1(16,17)=520;
a1(17,19)=170;
a1(19,18)=88;a1(19,21)=160;
a1(20,21)=70;
a1(21,22)=320;
a1(22,23)=160;
a1(23,24)=290;
a1=a1+a1';
a1(a1==0)=inf;
for k=1:n
    for i=1:n
        for j=1:n
            if a1(i,j)>a1(i,k)+a1(k,j)
                a1(i,j)=a1(i,k)+a1(k,j);
            end
        end
    end
end
a1(a1==inf)=0;

c1=zeros(n);
for i=1:n
    for j=1:n
        if a1(i,j)==0
            c1(i,j)=inf;
        elseif a1(i,j)<300
            c1(i,j)=20;
        elseif a1(i,j)<350
            c1(i,j)=23;
        elseif a1(i,j)<400
            c1(i,j)=26;
        elseif a1(i,j)<450
            c1(i,j)=29;
        elseif a1(i,j)<500
            c1(i,j)=32;
        elseif a1(i,j)<600
            c1(i,j)=37;
        elseif a1(i,j)<700
            c1(i,j)=44;
        elseif a1(i,j)<800
            c1(i,j)=50;
        elseif a1(i,j)<900
            c1(i,j)=55;
        elseif a1(i,j)<=1000
            c1(i,j)=60;
        elseif a1(i,j)>1000
            c1(i,j)=60+ceil((a1(i,j)-1000)/100)*5;
        end
    end
end

%公路的最短路径及最少运费
a2=zeros(n);
a2(1,31)=31;
a2(6,38)=110;
a2(7,39)=20;
a2(8,26)=3;
a2(9,27)=2;
a2(11,29)=10;
a2(12,28)=600;
a2(13,30)=5;
a2(14,31)=10;
a2(15,32)=12;
a2(16,33)=42;
a2(17,34)=70;
a2(18,35)=10;
a2(20,36)=10;
a2(22,37)=62;
a2(23,38)=30;
a2(24,39)=20;
a2(25,26)=104;
a2(26,27)=301;
a2(27,28)=750;
a2(28,29)=606;
a2(29,30)=194;
a2(30,31)=205;
a2(31,32)=201;
a2(32,33)=680;
a2(33,34)=480;
a2(34,35)=300;
a2(35,36)=220;
a2(36,37)=210;
a2(37,38)=420;
a2(38,39)=500;
a2=a2+a2';
a2(a2==0)=inf;
for k=1:n
    for i=1:n
        p2=[i];
        for j=1:n
            if a2(i,j)>a2(i,k)+a2(k,j)
                a2(i,j)=a2(i,k)+a2(k,j);
            end
        end
    end
end
a2(a2==inf)=0;
c2=a2.*0.1;

%拼接铁路公路
c2(c2==0)=inf;
%钢厂由铁路运到本地的运费为0
for g=1:n
    for h=1:n
       if g==h
           c1(g,h)=0;
       end
    end
end

d=[1000];
c=zeros(7,15);
for i=1:7
    for k=25:39
        for j=1:39
            c(i,k-24)=c1(i,j)+c2(j,k);
            d=[d c(i,k-24)];
            c(i,k-24)=min(d);
        end
        d=[1000];
    end
end



